# Consider following code to answer further questions:
import pandas as pd
course_name = [‘Data Science’, ‘Machine Learning’, ‘Big Data’, ‘Data Engineer’]
duration = [2,3,6,4]
df = pd.DataFrame(data = {‘course_name’ : course_name, ‘duration’ : duration})

In [5]:
import pandas as pd

In [6]:
course_name = ["Data Science", "Machine Learning", "Big Data", "Data Engineer"]
duration = [2,3,6,4]

In [7]:
df = pd.DataFrame(data = {"course_name" : course_name, "duration" : duration})

In [8]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

# Q1. Write a code to print the data present in the second row of the dataframe, df.

In [11]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

# Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

The main difference between loc and iloc is the way they are indexed. loc is label-based indexing, which means it is used to select data based on the row and column labels. On the other hand, iloc is integer-based indexing, which means it is used to select data based on the integer position of rows and columns.

# Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2]. Did you observe any difference in both the outputs? If so then explain it.

In [12]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [14]:
new_df = df.reindex([3,0,1,2])

In [16]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [15]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [17]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

new_df.loc[2] = This is giving the output by the row label i.e 2 in this case.


new_df.iloc[2] = This is giving the output by the selecting the integer position of row, starting from 0.

In [18]:
# Consider the below code to answer further questions:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]

#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [19]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.633914  0.215771  0.109208  0.412546  0.704338  0.136446
2  0.017355  0.775477  0.889221  0.268647  0.598849  0.933075
3  0.118190  0.150787  0.318067  0.391990  0.033470  0.774665
4  0.037292  0.581557  0.011721  0.374903  0.026935  0.965964
5  0.735256  0.833061  0.520287  0.066059  0.314282  0.886997
6  0.528912  0.394247  0.637592  0.530629  0.765559  0.634141

# Q4. Write a code to find the following statistical measurements for the above dataframe df1:

In [20]:
# (i) mean of each and every column present in the dataframe.
df1.mean()

column_1    0.345153
column_2    0.491817
column_3    0.414349
column_4    0.340796
column_5    0.407239
column_6    0.721881
dtype: float64

In [24]:
# (ii) standard deviation of column, ‘column_2’
df1["column_2"].std()

0.2853019833043123

# Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2. If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [32]:
df1["column_2"].loc[2] = "sumit"

In [35]:
df1["column_2"].mean()


'''
The reason for the error is that : 
The mean is the average of the interger values, Calculated as total sum of values / Number of values
But in this case there is a string value in the between , and the sum of int and str value is not possible logically
'''

TypeError: unsupported operand type(s) for +: 'float' and 'str'

# Q6. What do you understand about the windows function in pandas and list the types of windows functions?

### In pandas, the window functions are used to perform calculations on a rolling window of data. A rolling window consists of a fixed number of consecutive data points, and the window "rolls" over the data frame as the calculation is performed. The window size and the frequency of the rolling operation can be specified.

### There are three types of window functions in pandas:

* Rolling window functions: Calculates a rolling window of values. The size of the window can be specified.
* Expanding window functions: Calculates values from the beginning of the time series up to the current time.
* Exponential weighted window functions: Calculates an exponentially weighted rolling window of values. The decay rate and the size of the window can be specified.

### Examples of each type of window function include:

* Rolling window functions: rolling_mean(), rolling_max(), rolling_min()
* Expanding window functions: cumsum(), cummax(), cummin()
* Exponential weighted window functions: ewma(), ewmstd(), ewmcorr()

# Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

In [40]:

date = pd.date_range(start = "2023-02-26" , end = "2023-02-28" )

In [41]:
pd.DataFrame(date)

           0
0 2023-02-26
1 2023-02-27
2 2023-02-28

# Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [42]:
# Prompt the user to enter the two dates
start_date = input("Enter the start date (YYYY-MM-DD): ")
end_date = input("Enter the end date (YYYY-MM-DD): ")

# Convert the dates to datetime objects
start = pd.to_datetime(start_date)
end = pd.to_datetime(end_date)

# Calculate the difference between the two dates
delta = end - start

# Display the result
print(f"The difference between {start_date} and {end_date} is:")
print(f"{delta.days} days, {delta.seconds//3600} hours, and {delta.seconds%3600//60} minutes")

Enter the start date (YYYY-MM-DD):  2023-02-26
Enter the end date (YYYY-MM-DD):  2023-02-28

The difference between 2023-02-26 and 2023-02-28 is:
2 days, 0 hours, and 0 minutes

# Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [53]:
# Prompt user to enter file path
file_path = input("Enter file path: ")

# Read CSV file into DataFrame
df = pd.read_csv(file_path)

# Prompt user to enter column name
column_name = input("Enter column name: ")

# Prompt user to enter category order
category_order = input("Enter category order (comma-separated): ").split(",")

# Convert column to categorical data type
df[column_name] = pd.Categorical(df[column_name], categories=category_order, ordered=True)

# Sort data by categorical column
sorted_df = df.sort_values(column_name)

# Display sorted data
print(sorted_df)

Enter file path:  https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Enter column name:  Pclass
Enter category order (comma-separated):  1,2,3

     PassengerId  Survived Pclass  \
0              1         0    NaN
1              2         1    NaN
2              3         1    NaN
3              4         1    NaN
4              5         0    NaN
..           ...       ...    ...
886          887         0    NaN
887          888         1    NaN
888          889         0    NaN
889          890         1    NaN
890          891         0    NaN

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [54]:
# Prompt user to enter file path, column name, and category order
file_path = input("Enter file path: ")
column_name = input("Enter column name: ")
category_order = input("Enter category order (comma-separated): ")

# Read CSV file
df = pd.read_csv(file_path)

# Convert column to categorical data type
df[column_name] = pd.Categorical(df[column_name], categories=category_order.split(","), ordered=True)

# Display sorted data
print(df.sort_values(column_name))

Enter file path:  https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Enter column name:  Pclass
Enter category order (comma-separated):  1,2,3

     PassengerId  Survived Pclass  \
0              1         0    NaN
1              2         1    NaN
2              3         1    NaN
3              4         1    NaN
4              5         0    NaN
..           ...       ...    ...
886          887         0    NaN
887          888         1    NaN
888          889         0    NaN
889          890         1    NaN
890          891         0    NaN

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [ ]:
df.sort_values(column_name)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,NaN,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,NaN,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,NaN,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,NaN,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,NaN,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,NaN,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,NaN,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,NaN,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,NaN,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,NaN,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Q10. Write a Python program that reads a CSV file containing sales data for different products and visualizes the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

In [61]:
# Prompt user to enter file path
file_path = input("Enter file path: ")

# Read CSV file
df = pd.read_csv(file_path)

# Convert 'Date' column to datetime
df['OrderDate'] = pd.to_datetime(df['OrderDate'])

# Group by 'Date' and 'Product Category', and sum the sales
grouped_df = df.groupby(['OrderDate', 'Item'])['Total'].sum().reset_index()

# Pivot the table to create a multi-index DataFrame
pivot_df = grouped_df.pivot(index='OrderDate', columns='Item', values='Total')

# Plot the stacked bar chart
pivot_df.plot(kind='bar')

print(df.columns)

Enter file path:  Practic sheet.Part 3 B.A - Sample Data.csv

TypeError: no numeric data to plot

In [ ]:
, stacked=True, figsize=(10, 6), xlabel='OrderDate', ylabel='Total', title='Sales by Product Category')

# Q11. You are given a CSV file containing student data that includes the student ID and their test score.

'''
Write a Python program that reads the CSV file, 
calculates the mean, median, and mode of the test scores, and displays the results in a table.

The program should do the following:
* Prompt the user to enter the file path of the CSV file containing the student data.
* Read the CSV file into a Pandas DataFrame.
* Calculate the mean, median, and mode of the test scores using Pandas tools.
* Display the mean, median, and mode in a table.

Assume the CSV file contains the following columns:
* Student ID: The ID of the student.
* Test Score: The score of the student's test.
'''

'''
Example usage of the program:
Enter the file path of the CSV file containing the student data: student_data.csv
+-----------+--------+
| Statistic | Value |
+-----------+--------+
| Mean | 79.6 |
| Median | 82 |
| Mode | 85, 90 |
+-----------+--------+
Assume that the CSV file student_data.csv contains the following data:
Student ID,Test Score
1,85
2,90
3,80
4,75
5,85
6,82
7,78
8,85
9,90
10,85
The program should calculate the mean, median, and mode of the test scores and display the results
in a table.
'''

In [63]:
student_data = {"Student_ID" : [1,2,3,4,5,6,7,8,9,10] , "Test_Score" : [85,90,80,75,85,82,78,85,90,85]}

In [65]:
stu_df = pd.DataFrame(student_data)

In [66]:
stu_df.to_csv("student_data.csv")

In [68]:
stu_df

   Student_ID  Test_Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [79]:
file_name = input("Enter the file path : ")
column_name = input("Enter the column name : ")

read_df = pd.read_csv(file_name)

mean = read_df[column_name].mean()
median = read_df[column_name].median()
mode = read_df[column_name].mode()

stats = pd.DataFrame({"Mean" : mean,
              "Median" : median,
              "Mode" : mode})
print (stats)

Enter the file path :  student_data.csv
Enter the column name :  Test_Score

   Mean  Median  Mode
0  83.5    85.0    85

In [80]:
stats

   Mean  Median  Mode
0  83.5    85.0    85

In [77]:
stu_df.describe()

       Student_ID  Test_Score
count    10.00000   10.000000
mean      5.50000   83.500000
std       3.02765    4.836206
min       1.00000   75.000000
25%       3.25000   80.500000
50%       5.50000   85.000000
75%       7.75000   85.000000
max      10.00000   90.000000